MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKL26Z128VLL4/mcu.h
#define IRQNUM                        0x00000F80      // Assigned Interrupt Request Number
#define IEHOST                        0x00000001      // Host Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_OTGISTAT register.
//
//*****************************************************************************

#define IDCHG                         0x00000080      // ID change
#define ONEMSEC                       0x00000040      // One millisecond timer
#define LINE_STATE_CHG                0x00000020      // Line state change
#define SESSVLDC                      0x00000008      // Session valid change
#define B_SESS_CHG                    0x00000004      // B session change
#define AVBUSCHG                      0x00000001      // A VBUS change


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_OTGICR register.
//
//*****************************************************************************

#define IDEN                          0x00000080      // ID Interrupt Enable
#define ONEMSECEN                     0x00000040      // One Millisecond Interrupt Enable
#define LINESTATEEN                   0x00000020      // Line State Change Interrupt Enable
#define SESSVLDEN                     0x00000008      // Session Valid Interrupt Enable
#define BSESSEN                       0x00000004      // B Session END Interrupt Enable
#define AVBUSEN                       0x00000001      // A VBUS Valid Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_OTGSTAT register.
//
//*****************************************************************************

#define ID                            0x00000080      // ID pin state
#define ONEMSECEN                     0x00000040      // One millisecond timer
#define LINESTATESTABLE               0x00000020      // Line state stable
#define SESS_VLD                      0x00000008      // Session valid
#define BSESSEND                      0x00000004      // B session end
#define AVBUSVLD                      0x00000001      // A VBUS valid


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_OTGCTL register.
//
//*****************************************************************************

#define DPHIGH                        0x00000080      // D+ Data Line pullup resistor enable
#define DPLOW                         0x00000020      // D+ Data Line pull-down resistor enable
#define DMLOW                         0x00000010      // D Data Line pull-down resistor enable
#define OTGEN                         0x00000004      // On-The-Go pullup/pulldown resistor enable


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_ISTAT register.
//
//*****************************************************************************

#define STALL                         0x00000080      // Stall Interrupt
#define ATTACH                        0x00000040      // Attach Interrupt
#define RESUME                        0x00000020      // Resume Interrupt
#define SLEEP                         0x00000010      // Sleep Interrupt
#define TOKDNE                        0x00000008      // TOKDNE Interrupt
#define SOFTOK                        0x00000004      // SOFTOK Interrupt
#define ERROR                         0x00000002      // ERROR Interrupt
#define USBRST                        0x00000001      // USBRST Interrupt


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_INTEN register.
//
//*****************************************************************************

#define STALLEN                       0x00000080      // STALL Interrupt Enable
#define ATTACHEN                      0x00000040      // ATTACH Interrupt Enable
#define RESUMEEN                      0x00000020      // RESUME Interrupt Enable
#define SLEEPEN                       0x00000010      // SLEEP Interrupt Enable
#define TOKDNEEN                      0x00000008      // TOKDNE Interrupt Enable
#define SOFTOKEN                      0x00000004      // SOFTOK Interrupt Enable
#define ERROREN                       0x00000002      // ERROR Interrupt Enable
#define USBRSTEN                      0x00000001      // USBRST Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_ERRSTAT register.
//
//*****************************************************************************

#define BTSERR                        0x00000080      // Bit Stuff Error
#define DMAERR                        0x00000020      // DMA Error
#define BTOERR                        0x00000010      // Bus Turnaround Time Error
#define DFN8                          0x00000008      // Data Field Not 8 bits
#define CRC16                         0x00000004      // CRC16 Error
#define CRC5EOF                       0x00000002      // CRC5/EOF Error
#define PIDERR                        0x00000001      // PID Error


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_ERREN register.
//
//*****************************************************************************

#define BTSERREN                      0x00000080      // BTSERR Interrupt Enable
#define DMAERREN                      0x00000020      // DMAERR Interrupt Enable
#define BTOERREN                      0x00000010      // BTOERR Interrupt Enable
#define DFN8EN                        0x00000008      // DFN8 Interrupt Enable
#define CRC16EN                       0x00000004      // CRC16 Interrupt Enable
#define CRC5EOFEN                     0x00000002      // CRC5/EOF Interrupt Enable
#define PIDERREN                      0x00000001      // PIDERR Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_STAT register.
//
//*****************************************************************************

#define ENDP                          0x00000780      // Endpoint Number
#define TX                            0x00000008      // Transmit Indicator
#define ODD                           0x00000004      // Odd Bank Indicator


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_CTL register.
//
//*****************************************************************************

#define JSTATE                        0x00000080      // JSTATE Signal
#define SE0                           0x00000040      // SE0 Signal
#define TXSUSPENDTOKENBUSY            0x00000020      // TXSUSPENDTOKENBUSY Signal
#define RESET                         0x00000010      // RESET Signal
#define HOSTMODEEN                    0x00000008      // HOSTMODEEN Signal
#define RESUME                        0x00000004      // RESUME Signal
#define ODDRST                        0x00000002      // ODDRST Signal
#define USBENSOFEN                    0x00000001      // USBENSOFEN Signal


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_ADDR register.
//
//*****************************************************************************

#define LSEN                          0x00000080      // Low Speed Enable
#define ADDR                          0x00001FC0      // Address


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_BDTPAGE1 register.
//
//*****************************************************************************

